app/serializers/order_serializer.rb

  end

  attribute :order_items do |order|
    order.order_items.map do |item|
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 1