app/controllers/orders_controller.rb

  def create
    order = current_user.orders.new()
    total = 0

    params[:order_items].each do |item|
      product = Product.find(item[:product_id])
      quantity = item[:quantity].to_i
      price = product.price.to_f

      total += price * quantity

      order.order_items.build(
        product: product,
        quantity: quantity,
        price: price,
        note: item[:note]
      )
    end

    order.total_price = total
    serialized_order = OrderSerializer.new(order).serializable_hash[:data][:attributes]
    ActionCable.server.broadcast("orders", serialized_order)
    if order.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 4 LIMIT 1
SELECT "orders".* FROM "orders"
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price", "note", "created_at", "updated_at") VALUES (1, 4, 2, 33.99, NULL, '2025-07-30 02:47:38.735585', '2025-07-30 02:47:38.735585') RETURNING "id"
INSERT INTO "orders" ("user_id", "total_price", "status", "created_at", "updated_at") VALUES (4, 67.98, 'pending', '2025-07-30 02:47:38.730560', '2025-07-30 02:47:38.730560') RETURNING "id"

  def show
    order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 3 LIMIT 1