app/controllers/products_controller.rb

  def index
    products = Product.all

    if products.empty?
---
SELECT "products".* FROM "products"
SELECT 1 AS one FROM "products" LIMIT 1

  def create
    product = Product.new(product_params)
    authorize product
    if product.save
---
INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ('Hazelnut Speculoos Bliss', 'Our Hazelnut Speculoos Bliss is a round cake with a caramel crunch base, topped with delicious speculoos flavour cream and finished off with Biscoff crumbs, biscuits, and hazelnut Ferreros.', 33.99, '2025-07-30 01:27:55.024846', '2025-07-30 01:27:55.024846') RETURNING "id"

  def show
    product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 6 LIMIT 1

  def destroy
    product = Product.find_by(id: params[:id])

    if product
      product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = 6 LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 6