app/controllers/users/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
---
  def respond_to_on_destroy
    if request.headers["Authorization"].present?
      jwt_payload = JWT.decode(request.headers["Authorization"].split(' ').last, "123")[0]
      current_user = User.find(jwt_payload['sub'])